#pragma once
int admin_menu()
{
	system("cls");
	int sel;

	printf("\t\t\t**************** 欢迎您！尊贵的系统管理员 **************\n\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                    请选择您的操作:                   |\n");
	printf("\t\t\t|------------------------------------------------------|\n\n\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 1   显示当前库存                     |\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 2   商品销售                         |\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 3   进货                             |\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 4   退货                             |\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 5   查询商品销量                     |\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 6   显示操作者信息                   |\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 7   显示供应商信息                   |\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 8   查找货物                         |\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 0   注销登录                         |\n");
	printf("\t\t\t|------------------------------------------------------|\n\n\n");

	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 请输入您的选择【0-8】：              |\n");
	printf("\t\t\t|------------------------------------------------------|\n\t\t\t");
	scanf("%d", &sel);
	getchar();
	while (sel < 0 || sel > 8)
	{
		printf("\t\t\t|------------------------------------------------------|\n");
		printf("\t\t\t|          输入错误,请重新输入您的选择【0-8】：        |\n");
		printf("\t\t\t|------------------------------------------------------|\n\t\t\t");
		scanf("%d", &sel);
	}

	switch (sel)
	{
	case 1:
		printCargo();
		admin_menu();
		break;
	case 2:
		sold_cargos();
		break;
	case 3:
		stock_cargos();
		break;
	case 4:
		return_cargos();
		break;
	case 5:
		salesrecords();
		admin_menu();
		break;
	case 6:
		show_user();
		admin_menu();
		break;
	case 7:
		show_supplier();
		admin_menu();
		break;
	case 8:
		search_cargo();
		admin_menu();
		break;
	case 0:
		menu();
		break;
	}
}
