int menu()
{
	int sel;
	system("cls");
	printf("\t\t\t***************** 欢迎来到仓库管理系统 *****************\n\n\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                    请选择您的操作:                   |\n");
	printf("\t\t\t|------------------------------------------------------|\n\n\n");

	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 1   系统管理员登录                   |\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 2   普通操作员登录                   |\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 3   系统管理员注册                   |\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 4   普通操作员注册                   |\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 5   选择颜色主题                     |\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 0   退出                             |\n");
	printf("\t\t\t|------------------------------------------------------|\n\n\n");
	printf("\n\n\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 请输入您的选择【0-5】：              |\n");
	printf("\t\t\t|------------------------------------------------------|\n\t\t\t");
	scanf("%d", &sel);
	getchar();
	while (sel < 0 || sel > 5)
	{
		printf("\t\t\t|------------------------------------------------------|\n");
		printf("\t\t\t|          输入错误,请重新输入您的选择【0-5】：        |\n");
		printf("\t\t\t|------------------------------------------------------|\n\t\t\t");
		scanf("%d", &sel);
	}
	switch (sel)
	{
	case 1:
		admin_login();
		break;
	case 2:
		user_login();
		break;
	case 3:
		admin_registers();
		menu();
		break;
	case 4:
		user_registers();
		menu();
		break;
	case 5:
		color_style();
		menu();
		break;
	case 0:
		exit(0);
	}
}
