void user_login()
{
	system("cls");
	int i, sel, sell;
	int flag = 0; // 登录标记
	struct user temUser;
	printf("\t\t\t***************** 欢迎来到仓库管理系统 *****************\n\n\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                    请选择您的操作:                   |\n");
	printf("\t\t\t|------------------------------------------------------|\n\n\n");

	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                  |仓库操作员登录界面|                |\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                  1   开始登录                        |\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                  2   返回上一级菜单                  |\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	
	printf("\n\n\n\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 请输入您的选择【1-2】：              |");
	printf("\n\t\t\t|------------------------------------------------------|\n\t\t\t");
	scanf("%d", &sel);
	getchar(); // 清除输入缓冲区中的换行符
	while (sel < 1 || sel > 2)
	{
		printf("\n\n\n\t\t\t|------------------------------------------------------|\n");
		printf("\t\t\t|            输入错误,请重新输入您的选择【1-2】：         |");
		printf("\n\t\t\t|------------------------------------------------------|\n\t\t\t");
		scanf("%d", &sel);
	}
	if (sel == 1)
	{

		printf("\n\n\n\t\t\t|------------------------------------------------------|\n");
		printf("\t\t\t|                    请填写登录信息:                   |\n");
		printf("\t\t\t|------------------------------------------------------|\n");
	here1:
		printf("\t\t\t输入用户名:");
		scanf("%s", &temUser.user_account);
		printf("\t\t\t输入密码:");
		scanf("%s", &temUser.user_password);

		for (i = 0; i < N; i++)
		{
			if (strcmp(users[i].user_account, temUser.user_account) == 0 && strcmp(users[i].user_password, temUser.user_password) == 0)
			{
				flag = 1;
				printf("\t\t\t登录成功,即将跳转至系统管理界面\n");

				// 模拟跳转界面的操作
				int j = 10;
				printf("\t\t\t");
				while (j-- >= 1)
				{
					printf(".");
					Sleep(50);
				}
				user_menu();
			}
		}
		if (flag == 0)
		{
			system("cls");
			printf("\n\n\n\t\t\t|------------------------------------------------------|\n");
			printf("\t\t\t|          你输入的用户名或密码有误,你可以选择:        |\n");
			printf("\t\t\t|------------------------------------------------------|\n");
			printf("\t\t\t|                 1 重新填写登录信息                   |\n");
			printf("\t\t\t|                 2 返回上一级菜单                     |\n");
			printf("\t\t\t|------------------------------------------------------|\n");
			printf("\n\n\n\t\t\t|------------------------------------------------------|\n");
			printf("\t\t\t|                 请输入您的选择【1-2】：              |");
			printf("\n\t\t\t|------------------------------------------------------|\n\t\t\t");
			scanf("%d", &sell);
			getchar();
			while (sell < 1 || sell > 2)
			{
				printf("\n\n\n\t\t\t|------------------------------------------------------|\n");
				printf("\t\t\t|            输入错误,请重新输入您的选择【1-2】：         |");
				printf("\n\t\t\t|------------------------------------------------------|\n\t\t\t");
				scanf("%d", &sell);
			}
			switch (sell)
			{
			case 1:
				goto here1;
				break;
			case 2:
				menu();
				break;
			}
		}
	}

	else if (sel == 2)
	{
		menu();
	}

	// 因为新用户注册成功，所以用户注册信息需要重新全部保存
	filesave();
	printf("\t\t\t");
	system("pause");
}
