
int user_menu()
{
	system("cls");
	int sel;

	printf("\t\t\t**************** 欢迎您！平凡的普通操作员 **************\n\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                    请选择您的操作:                   |\n");
	printf("\t\t\t|------------------------------------------------------|\n\n\n");

	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 1   显示当前库存                     |\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 2   查找货物                         |\n");
	printf("\t\t\t|------------------------------------------------------|\n");
	printf("\t\t\t|                 0   注销登录                         |\n");
	printf("\t\t\t|------------------------------------------------------|\n");

	printf("\n\n\n\t\t\t请输入您的选择【0-2】：");
	scanf("%d", &sel);
	getchar();
	while (sel<0 || sel>2)
	{
		printf("\t\t\t输入错误,请重新输入您的选择【0-1】：");
		scanf("%d", &sel);
	}

	switch (sel)
	{
		case 1:
			printCargo();
			user_menu();
			break;
		case 2:
			search_cargo();
			user_menu();
			break;
		case 0:
			menu();
	}
}
